In [3]:
import pandas as pd
df = pd.read_csv(r"E:\study materials\python\py-master\pandas\21_sql\customers.csv")
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [4]:
df.rename(columns = {
    'Customer Name':"Name",
    'Customer Phone':"Phone_number"
},inplace = True
)
df

              Name  Phone_number
0     rafael nadal    4567895647
1  maria sharapova     434534545
2   vladimir putin      89345345
3      kim un jong     123434456
4       jeff bezos     934534543
5     rahul gandhi      44324222